md-asaduzzaman-shahin/esp32_csi_sensing_fall_detection/transmitter/managed_components/espressif__esp-radar/include/esp_radar.h
/**
 * @brief Initialize ESP-NOW subsystem for radar
 *
 * This function initializes ESP-NOW with the specified peer address and PMK (Pairwise Master Key).
 * It sets up the ESP-NOW peer and configures the physical layer rate.
 * Note: WiFi must be initialized first (via esp_radar_wifi_init()).
 *
 * @param config Pointer to the ESP-NOW configuration structure. Must not be NULL.
 * @return
 *        - ESP_OK: Success
 *        - ESP_ERR_INVALID_ARG: Invalid argument
 *        - ESP_ERR_INVALID_STATE: WiFi not initialized
 */
esp_err_t esp_radar_espnow_init(esp_radar_espnow_config_t *config);

/**
 * @brief Initialize radar decoder subsystem
 *
 * This function initializes the radar decoder with the specified configuration.
 * It sets up the decoder callbacks, LTF type, sub-carrier step size, and algorithm parameters.
 *
 * @param config Pointer to the decoder configuration structure. Must not be NULL.
 * @return
 *        - ESP_OK: Success
 *        - ESP_ERR_INVALID_ARG: Invalid argument
 */
esp_err_t esp_radar_dec_init(esp_radar_dec_config_t *config);

/**
 * @brief Get current radar configuration
 *
 * This function retrieves the current configuration of all radar subsystems
 * (WiFi, CSI, ESP-NOW, and decoder) and copies them to the provided structure.
 *
 * @param config Pointer to the configuration structure where the current config will be stored. Must not be NULL.
 * @return
 *        - ESP_OK: Success
 *        - ESP_ERR_INVALID_ARG: Invalid argument
 */
esp_err_t esp_radar_get_config(esp_radar_config_t *config);

/**
 * @brief Change radar configuration at runtime
 *
 * This function updates the radar configuration while the system is running.
 * If radar is currently running, it will be stopped, configuration updated, and then restarted.
 * Only changed configurations are updated (compared by memcmp).
 *
 * @param config Pointer to the new configuration structure. Must not be NULL.
 * @return
 *        - ESP_OK: Success
 *        - ESP_ERR_INVALID_ARG: Invalid argument
 */
esp_err_t esp_radar_change_config(esp_radar_config_t *config);

/**
 * @brief Start radar calibration/training mode
 *
 * This function starts the calibration process for the radar system.
 * During calibration, the system collects reference data to calculate thresholds
 * for detecting human presence (wander) and movement (jitter).
 * The calibration status is set to RADAR_CALIBRATE_PROGRESS.
 *
 * @return
 *        - ESP_OK: Success
 */
esp_err_t esp_radar_train_start(void);

/**
 * @brief Remove all calibration data
 *
 * This function clears all collected calibration data and resets the calibration status.
 * The calibration data buffers are freed, and statistics are reset.
 * The calibration status is set to RADAR_CALIBRATE_NO.
 *
 * @return
 *        - ESP_OK: Success
 */
esp_err_t esp_radar_train_remove(void);

/**
 * @brief Stop calibration and get calculated thresholds
 *
 * This function stops the calibration process and calculates the thresholds
 * for wander (human presence detection) and jitter (human movement detection).
 * The calibration status is set to RADAR_CALIBRATE_COMPLETE.
 *
 * @param wander_threshold Pointer to store the calculated wander threshold (1 - average correlation).
 *                         Can be NULL if not needed.
 * @param jitter_threshold Pointer to store the calculated jitter threshold (1 - static correlation).
 *                        Can be NULL if not needed.
 * @return
 *        - ESP_OK: Success
 *        - ESP_ERR_NOT_SUPPORTED: Calibration not initialized
 *        - ESP_ERR_INVALID_STATE: No calibration data collected
 */
esp_err_t esp_radar_train_stop(float *wander_threshold, float *jitter_threshold);

#ifdef __cplusplus
}
#endif
